Revit 2027 API
Alignment.GetHCurveTangentAtStation Method
 Calculate 2d (X and Y components of returned vector) horizontal tangent at given station.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetHCurveTangentAtStation(
	double station
)
Public Function GetHCurveTangentAtStation (
	station As Double
) As XYZ
public:
XYZ^ GetHCurveTangentAtStation(
	double station
)
member GetHCurveTangentAtStation :
        station : float -> XYZ
Parameters
station Double
Alignment station to calculate 2d horizontal tangent for, in Revit internal model units (standard Imperial feet).
Return Value
XYZ
2d (X and Y components of returned vector) horizontal tangent at given station.
See Also
Reference
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace